benchmarks/lora/definitive_results/results_extras/extract_max_achievable_throughput_by_rank/llama-3.1-8b-instruct/_1_32_/log_39466827.out
INFO 04-21 15:29:02 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='openai', base_url=None, host='localhost', port=32486, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/experiment_data/llm_benchmarking/data/ShareGPT_V3_unfiltered_cleaned_split.json', model='/gpfs/scratch/bsc98/bsc098069/experiment_data/llm_benchmarking/models/llama/llama-3.1-8b-instruct', tokenizer=None, num_prompts=8192, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, request_rate=inf, request_rate_by_lora=None, seed=0, trust_remote_code=False, disable_tqdm=False, save_result=True, metadata=None, result_dir='benchmarks/lora/definitive_results/finding_maximum/extract_max_achievable_throughput_by_rank/llama-3.1-8b-instruct/_1_32_', launch_server=True, server_args='--port=32486 --disable-log-requests --model="/gpfs/scratch/bsc98/bsc098069/experiment_data/llm_benchmarking/models/llama/llama-3.1-8b-instruct" --max-num-seqs="2048" --scheduler-cls="vllm.v1.core.sched.scheduler.Scheduler" --no-enable-prefix-caching --enable-lora --dummy-lora-modules="/gpfs/scratch/bsc98/bsc098069/experiment_data/llm_benchmarking/models/llama/llama-3.1-8b-instruct/lora/lora-finance_dummy_rank_32" --max-loras=1 --max-lora-rank=32', server_init_time=1800, disable_log_stats=False, disable_loras_users=False, user_lora_request_relation=None, restrict_loras=None, lora_pre_loading=False, use_synthetic_dataset=None, synthetic_input_length=None, synthetic_output_length=None)
Server started
Models {'object': 'list', 'data': [{'id': '/gpfs/scratch/bsc98/bsc098069/experiment_data/llm_benchmarking/models/llama/llama-3.1-8b-instruct', 'object': 'model', 'created': 1776778328, 'owned_by': 'vllm', 'root': '/gpfs/scratch/bsc98/bsc098069/experiment_data/llm_benchmarking/models/llama/llama-3.1-8b-instruct', 'parent': None, 'max_model_len': 131072, 'permission': [{'id': 'modelperm-42d13a5d37924804aeabd0703aa6c7dc', 'object': 'model_permission', 'created': 1776778328, 'allow_create_engine': False, 'allow_sampling': True, 'allow_logprobs': True, 'allow_search_indices': False, 'allow_view': True, 'allow_fine_tuning': False, 'organization': '*', 'group': None, 'is_blocking': False}]}, {'id': 'dummy-0', 'object': 'model', 'created': 1776778328, 'owned_by': 'vllm', 'root': '/gpfs/scratch/bsc98/bsc098069/experiment_data/llm_benchmarking/models/llama/llama-3.1-8b-instruct/lora/lora-finance_dummy_rank_32', 'parent': '/gpfs/scratch/bsc98/bsc098069/experiment_data/llm_benchmarking/models/llama/llama-3.1-8b-instruct', 'max_model_len': None, 'permission': [{'id': 'modelperm-ccac5db694e84b67a75dd39125165d72', 'object': 'model_permission', 'created': 1776778328, 'allow_create_engine': False, 'allow_sampling': True, 'allow_logprobs': True, 'allow_search_indices': False, 'allow_view': True, 'allow_fine_tuning': False, 'organization': '*', 'group': None, 'is_blocking': False}]}]}
Requests users. Values: ['0']. Counts: [8192]
Requests loras. Values: ['dummy-0']. Counts: [8192]
Starting initial single prompt test run for base model
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     8192      
Benchmark duration (s):                  237.25    
Total input tokens:                      1806849   
Total generated tokens:                  1632442   
Request throughput (req/s):              34.53     
Input token throughput (tok/s):          7615.74   
Output token throughput (tok/s):         6880.63   
---------------Time to First Token----------------
Mean TTFT (ms):                          96054.41  
Median TTFT (ms):                        94102.66  
P99 TTFT (ms):                           195037.05 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          104.59    
Median TPOT (ms):                        107.60    
P99 TPOT (ms):                           127.41    
---------------Inter-token Latency----------------
Mean ITL (ms):                           101.31    
Median ITL (ms):                         108.32    
P99 ITL (ms):                            139.10    
==================================================
Concurrent checker terminated
Server terminated